In [2]:
import pandas as pd

C:\Users\miemt\AppData\Local\Temp\ipykernel_49128\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
def check_null(df):
    # Check for null values in each column
    null_counts = df.isnull().sum()

    # Print columns with null values
    print("Columns with null values:")
    print(null_counts[null_counts > 0])

In [15]:
# Function to convert C40 to True and NaN to False
def convert_to_boolean(value):
    if value == 'C40':
        return True
    else:
        return False

# 2016

In [13]:
df = pd.read_csv("../DB/Data/2016_-_Citywide_GHG_Emissions_20240207.csv")
df[:1]

,Account Number,City Name,Country,City Short Name,C40,Reporting Year,Measurement Year,Boundary,Primary Methodology,Methodology Details,...,Current Population,City GDP,GDP Currency,Year of GDP,GDP Source,Average annual temperature (in Celsius)​,​Land area (in square km),Average altitude (m),City Location,Country Location
0,35894,Ville de Montreal,Canada,Montreal,NaN,2016,12/31/2009 12:00:00 AM,Other: The regional entity that constitutes th...,2006 IPCC Guidelines for National Greenhouse G...,2006 IPCC Guidelines for National Greenhouse G...,...,1886481.0,1.201180e+11,CAD Canadian Dollar,2014.0,"Ville de Montréal, Montréal en statistiques, h...",6.8,500.0,17.0,"(45.5086699, -73.5539925)","(56.130366, -106.346771)"

In [21]:
print(sorted(list(df.columns)))

['Account Number', 'Average altitude (m)', 'Average annual temperature (in Celsius)\u200b', 'Boundary', 'C40', 'City', 'City GDP', 'City Location', 'City Name', 'Country', 'Country Location', 'Current Population', 'Current Population Year', 'GDP Currency', 'GDP Source', 'Gases included', 'Increase/Decrease from last year', 'Measurement Year', 'Methodology Details', 'Primary Methodology', 'Reason for increase/decrease in emissions', 'Reporting Year', 'Total City-wide Emissions (metric tonnes CO2e)', 'Total Scope 1 Emissions (metric tonnes CO2e)', 'Total Scope 2 Emissions (metric tonnes CO2e)', 'Year of GDP', '\u200bLand area (in square km)']

In [16]:
df['C40'] = df['C40'].apply(lambda x: convert_to_boolean(x))

In [17]:
df.rename(columns={'City Short Name': 'City'}, inplace=True)

In [23]:
df.rename(columns={'Total City-wide Emissions (metric tonnes CO2e)': 'Total Emissions'}, inplace=True)

In [41]:
df1 = df[["Country", "City", "C40" , "Reporting Year", "City Location", "Country Location", "Total Emissions" ]]

In [42]:
df1

,Country,City,C40,Reporting Year,City Location,Country Location,Total Emissions
0,Canada,Montreal,False,2016,"(45.5086699, -73.5539925)","(56.130366, -106.346771)",13722942.0
1,United Kingdom,Manchester,False,2016,"(53.4575955, -2.1578377)","(55.378051, -3.435973)",14889318.0
2,USA,Reno,False,2016,"(39.5296, -119.8138)","(37.09024, -95.712891)",4437665.0
3,USA,Minneapolis,False,2016,"(44.983334, -93.26667)","(37.09024, -95.712891)",4794708.0
4,Canada,"London, ON",False,2016,"(42.9837, -81.2497)","(56.130366, -106.346771)",3070000.0
...,...,...,...,...,...,...,...
182,Denmark,Gladsaxe Kommune,False,2016,"(55.733461, 12.488686)","(56.26392, 9.501785)",362078.0
183,USA,Houston,True,2016,"(29.7601927, -95.3693896)","(37.09024, -95.712891)",33428301.0
184,Nigeria,Lagos,True,2016,"(6.524379, 3.379206)","(9.081999, 8.675277)",29426266.0
185,Canada,Peterborough,False,2016,"(44.309058, -78.319747)","(56.130366, -106.346771)",283061.0
186,Ecuador,Distrito Metropolitano de Quito,True,2016,"(-0.2333, -78.5167)","(-1.831239, -78.183406)",5233350.0

# 2017

In [26]:
df2 = pd.read_csv("../DB/Data/2017_-_Cities_Community_Wide_Emissions.csv")
#df2.columns = df2.columns.str.upper()
df2[:1]

,Account number,Organization,City,Country,Region,C40,Access,Reporting year,Accounting year,Boundary,...,Population year,GDP,GDP Currency,GDP Year,GDP Source,Average annual temperature (in Celsius)​,​Average altitude (m),​Land area (in square km),City Location,Country Location
0,49363,Nelson Mandela Bay Municipality,Nelson Mandela Bay,South Africa,Africa,NaN,Public,2017,2013-07-01 - 2014-06-30,A metropolitan area,...,2011,52147.0,ZAR South African Rand,2010.0,Built Environment Performance Plan(BEPP),17.5,69.0,1950.0,"(-33.745241, 25.568108)","(-30.559482, 22.937506)"

In [27]:
print(sorted(list(df2.columns)))

['Access', 'Account number', 'Accounting year', 'Average annual temperature (in Celsius)\u200b', 'Boundary', 'C40', 'City', 'City Location', 'Comment', 'Country', 'Country Location', 'GDP', 'GDP Currency', 'GDP Source', 'GDP Year', 'Gases included', 'Increase/Decrease from last year', 'Organization', 'Population', 'Population year', 'Protocol', 'Protocol column', 'Reason for increase/decrease in emissions', 'Region', 'Reporting year', 'Scopes Included ', 'Total Scope 1 Emissions (metric tonnes CO2e)', 'Total Scope 2 Emissions (metric tonnes CO2e)', 'Total emissions (metric tonnes CO2e)', '\u200bAverage altitude (m)', '\u200bLand area (in square km)']

In [28]:
df2['C40'] = df2['C40'].apply(lambda x: convert_to_boolean(x))

In [29]:
df2.rename(columns={'Total emissions (metric tonnes CO2e)': 'Total Emissions'}, inplace=True)

In [31]:
df2.rename(columns={'Reporting year': 'Reporting Year'}, inplace=True)

In [32]:
df3 = df2[["Country", "City", "C40" , "Reporting Year", "City Location", "Country Location", "Total Emissions" ]]

In [25]:
df3

,Country,City,C40,Reporting Year,City Location,Country Location,Total Emissions
0,Canada,Montreal,False,2016,"(45.5086699, -73.5539925)","(56.130366, -106.346771)",13722942.0
1,United Kingdom,Manchester,False,2016,"(53.4575955, -2.1578377)","(55.378051, -3.435973)",14889318.0
2,USA,Reno,False,2016,"(39.5296, -119.8138)","(37.09024, -95.712891)",4437665.0
3,USA,Minneapolis,False,2016,"(44.983334, -93.26667)","(37.09024, -95.712891)",4794708.0
4,Canada,"London, ON",False,2016,"(42.9837, -81.2497)","(56.130366, -106.346771)",3070000.0
...,...,...,...,...,...,...,...
182,Denmark,Gladsaxe Kommune,False,2016,"(55.733461, 12.488686)","(56.26392, 9.501785)",362078.0
183,USA,Houston,True,2016,"(29.7601927, -95.3693896)","(37.09024, -95.712891)",33428301.0
184,Nigeria,Lagos,True,2016,"(6.524379, 3.379206)","(9.081999, 8.675277)",29426266.0
185,Canada,Peterborough,False,2016,"(44.309058, -78.319747)","(56.130366, -106.346771)",283061.0
186,Ecuador,Distrito Metropolitano de Quito,True,2016,"(-0.2333, -78.5167)","(-1.831239, -78.183406)",5233350.0

# Combine 2016 and 2017

In [36]:
df_combined = pd.concat([df1, df3], ignore_index=True)

In [37]:
df_combined

,Country,City,C40,Reporting Year,City Location,Country Location,Total Emissions
0,Canada,Montreal,False,2016,"(45.5086699, -73.5539925)","(56.130366, -106.346771)",13722942.0
1,United Kingdom,Manchester,False,2016,"(53.4575955, -2.1578377)","(55.378051, -3.435973)",14889318.0
2,USA,Reno,False,2016,"(39.5296, -119.8138)","(37.09024, -95.712891)",4437665.0
3,USA,Minneapolis,False,2016,"(44.983334, -93.26667)","(37.09024, -95.712891)",4794708.0
4,Canada,"London, ON",False,2016,"(42.9837, -81.2497)","(56.130366, -106.346771)",3070000.0
...,...,...,...,...,...,...,...
411,Portugal,Torres Vedras,False,2017,"(38.763669, -9.30148)","(39.399872, -8.224454)",275646.0
412,Brazil,Extrema,False,2017,"(-22.840262, -46.328)","(-14.235004, -51.92528)",131931.0
413,Netherlands,Amsterdam,True,2017,"(52.370216, 4.895168)","(52.132633, 5.291266)",4138000.0
414,USA,Palo Alto,False,2017,"(37.4419, -122.143)","(37.09024, -95.712891)",153948.0
415,USA,Cleveland,False,2017,"(41.4993, -81.6944)","(37.09024, -95.712891)",7688447.0

In [38]:
check_null(df_combined)

Columns with null values:
Total Emissions    12
dtype: int64

# Save to new CSV file

In [46]:
df_combined.to_csv('../DB/Data/combined_emission_report.csv', index=False)